//==============================================================
//
//SHOOTING GAME[ranking.cpp]
//Author:Irisawa Kazan
//
//==============================================================
#include"main.h"
#include"ranking.h"

//ランキングスコアの構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;//位置
	int nScore;     //スコア
}RankScore;

//グローバル変数宣言
LPDIRECT3DTEXTURE9 g_pTextureRank = NULL;          //テクスチャへのポインタ
LPDIRECT3DTEXTURE9 g_pTextureRankScore = NULL;     //テクスチャへのポインタ
LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffRank = NULL;     //頂点バッファのポインタ
LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffRankScore = NULL;//頂点バッファのポインタ
RankScore g_aRankScore[MAX_RANK];                  //ランキングスコア情報
int g_nRankUpdate = -1;                            //更新ランクNo.
int g_nTimerRanking;                               //ランキング画面表示タイマー

//==============================================================
//ランキングの初期化処理
//==============================================================
void InitRanking(void)
{

}

//==============================================================
//ランキングの終了処理
//==============================================================
void UninitRanking(void)
{

}

//==============================================================
//ランキングの更新処理
//==============================================================
void UpdateRanking(void)
{

}

//==============================================================
//ランキングの描画処理
//==============================================================
void DrawRanking(void)
{

}

//==============================================================
//ランキングのリセット処理
//==============================================================
void ResetRanking(void)
{

}

//==============================================================
//ランキングの設定処理
//==============================================================
void SetRanking(int nScore)
{

}