//==============================================================
//
//3D_GAME[clear.cpp]
//Author:Irisawa Kazan
//
//==============================================================
#include"clear.h"

//グローバル変数宣言
CLEAR g_clear = CLEAR_1;//現在のモード

//==============================================================
//クリア画面の初期化処理
//==============================================================
void InitClear(void)
{
	switch (g_clear)
	{
	case CLEAR_1:
		InitClearfirst();
		break;

	case CLEAR_2:
		InitClearsecond();
		break;
	}
}

//==============================================================
//クリア画面の終了処理
//==============================================================
void UninitClear(void)
{
	switch (g_clear)
	{
	case CLEAR_1:
		UninitClearfirst();
		break;
	}
}

//==============================================================
//クリア画面の更新処理
//==============================================================
void UpdateClear(void)
{
	switch (g_clear)
	{
	case CLEAR_1:
		UpdateClearfirst();
		break;

	case CLEAR_2:
		UpdateClearsecond();
		break;
	}
}

//==============================================================
//クリア画面の描画処理
//==============================================================
void DrawClear(void)
{
	switch (g_clear)
	{
	case CLEAR_1:
		DrawClearfirst();
		break;

	case CLEAR_2:
		DrawClearsecond();
		break;
	}
}

//==============================================================
//クリアの設定
//==============================================================
void SetClear(CLEAR clear)
{
	g_clear = clear;
}

//==============================================================
//クリアの取得
//==============================================================
CLEAR GetClear(void)
{
	return g_clear;
}